app/controllers/personas_controller.rb

  def index
    @personas = Persona.all
---
SELECT * FROM `pr_persona`

  def show
    @persona = Persona.find(params[:id])
---
SELECT * FROM `personas` WHERE (`personas`.`persona_id` = '42319f92-710c-11e5-b967-3417ebba8c77')

  def show_by_curp
    @persona = Persona.find(:first, :conditions => ["per_curp = ?", params[:curp]])
---
SELECT * FROM `pr_persona` WHERE (`pr_persona`.`per_curp` = 'LOLJ760313HCSPPL09') LIMIT 1

  def edit
    @persona = Persona.find(params[:id])
---
SELECT * FROM `personas` WHERE (`personas`.`persona_id` = '42319f92-710c-11e5-b967-3417ebba8c77')

  def create
    @persona = Persona.new(params[:persona])

    respond_to do |format|
      if @persona.save
---
INSERT INTO `personas` (`per_materno`, `per_activo_reg`, `persona_id`, `per_paterno`, `per_rfc`, `per_curp`, `per_nombre`, `per_tipo`, `per_elaboracion`, `per_modificacion`) VALUES('LOPEZ', 1, '--- !ruby/object:UUIDTools::UUID \nclock_seq_hi_and_reserved: 182\nclock_seq_low: 173\nhash: 127235270\ninteger: 9612765131454853606286835585083797520\nnodes: \n- 202\n- 22\n- 109\n- 180\n- 112\n- 16\ntime_hi_and_version: 13854\ntime_low: 121330153\ntime_mid: 42757\n', 'MONTERROSA', 'MOLC95', 'MOLC850912HCSNPR02', 'CARLOS', '', '2015-10-12 17:55:00', '2015-10-12 17:55:00')

  def destroy
    @persona = Persona.find(params[:id])
    @persona.destroy
---
DELETE FROM `pr_persona` WHERE `id_persona` = 'f21744ac-7116-11e5-a7e3-3417ebba8c77'